<html><body>
<!-- $XConsortium: ch03.sgm /main/2 1996/12/17 15:36:15 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Navigate.div.1">
<title id="INFOUG.Navigate.mkr.1">Naviguer dans le Gestionnaire des informations</title>
<p>Outre la structure de livre traditionnelle, il existe d'autres mani&egrave;res
de naviguer dans une biblioth&egrave;que d'informations. Vous pouvez, par
exemple, lire les livres d'une biblioth&egrave;que en suivant les <u>
liens</u> menant &agrave; des informations connexes. Vous pouvez aussi
utiliser les fonctionnalit&eacute;s Historique et Carte pour localiser les
informations d&eacute;sir&eacute;es.</p>
<p>Ce chapitre offre des informations sur:</p>
<ul>
<a  role="JumpText" href="#INFOUG.Navigate.div.2" ><li><p></a></p>
</li>
<a  role="JumpText" href="#INFOUG.Navigate.div.3" ><li><p></a></p>
</li>
<a  role="JumpText" href="#INFOUG.Navigate.div.6" ><li><p></a></p>
</li>
<a  role="JumpText" href="#INFOUG.Navigate.div.8" ><li><p></a></p>
</li>
<a  role="JumpText" href="#INFOUG.Navigate.div.11" ><li><p></a></p>
</li>
<a  role="JumpText" href="#INFOUG.Navigate.div.12" ><li><p></a></p>
</li>
</ul>
<p>Il est &eacute;galement possible de rechercher rapidement des informations
sur un &eacute;l&eacute;ment sp&eacute;cifique. Consultez la section <!--Original
<a  role="JumpText" href="#INFOUG.Search.mkr.1" >XRef content: 'Rechercher des informations</a>
pour obtenir des instructions compl&eacute;mentaires sur le lancement d'une
recherche, la formulation des crit&egrave;res de recherche et la d&eacute;finition
de l'&eacute;tendue de la recherche.</p>
<div class="1" id="INFOUG.Navigate.div.2">
<h1 id="INFOUG.Navigate.mkr.2">Identifier votre position actuelle<!---- 
<primary>position</primary><secondary>actuelle, identifier</secondary>----> </h1>
<p>Les liens hypertexte vous permettent de vous d&eacute;placer rapidement
et ais&eacute;ment d'une section &agrave; une autre, voire m&ecirc;me d'un
livre &agrave; un autre. Au fil de vos d&eacute;placements dans un livre ou
m&ecirc;me dans toute une biblioth&egrave;que, il est relativement facile
de perdre de vue votre position actuelle. Pour identifier rapidement votre
position actuelle, proc&eacute;dez de la mani&egrave;re suivante:</p>
<ul>
<a  role="JumpText" href="#INFOUG.Navigate.mkr.3" ><li><p>Points d'implantation. Voir</a>.
</p>
</li>
<li><p>Historique automatique (la Liste de livres). Voir <xref role="JumpText"
href="#INFOUG.Rdbooks.div.3">.</p>
</li>
<li><p>Affichage de la section pr&eacute;c&eacute;dente (l'Historique).
<a  role="JumpText" href="#INFOUG.Navigate.mkr.11" >Voir </a>.</p>
</li>
<a  role="JumpText" href="#INFOUG.Navigate.mkr.12" ><li><p>La carte graphique. Voir </a>.
</p>
</li>
</ul>
</div>
<div class="1" id="INFOUG.Navigate.div.3">
<h1 id="INFOUG.Navigate.mkr.3">Utiliser les points d'mplantation<!---- 
<primary>points d'implantation</primary><secondary>utiliser</secondary>----> </h1>
<p>Chaque livre et chaque section de livre est associ&eacute;e &agrave;
un identificateur unique nomm&eacute; <u>point d'implantation</u>.
Le Gestionnaire des informations vous permet d'afficher les points d'implantation
et de les utiliser pour acc&eacute;der aux sections qu'ils identifient.</p>
<div class="2" id="INFOUG.Navigate.div.4">
<h2 id="INFOUG.Navigate.mkr.4">Afficher les points d'implantation<!---- 
<primary>Afficher le point d'implantation</primary>----> <!---- 
<primary>point d'implantation</primary><secondary>afficher</secondary>----> <!---- 
<primary>position</primary><secondary>afficher le point d'implantation</secondary>
----> <!---- <primary>emplacement</primary>----> </h2>
<p>Pour afficher le point d'implantation du livre et de la section que
vous visualisez actuellement, choisissez Afficher le point d'implantation
sur le menu Explorateur. Le Gestionnaire des informations affiche le point
d'implantation dans la zone de message au bas de la fen&ecirc;tre.</p>
<p>Pour retourner &agrave; une section par la suite, vous pouvez enregistrer
son point d'implantation puis le sp&eacute;cifier &agrave; l'aide d'Ouvrir
le point d'implantation.</p>
</div>
<div class="2" id="INFOUG.Navigate.div.5">
<h2 id="INFOUG.Navigate.mkr.5">Aller aux points d'implantation<!---- 
<primary>Ouvrir le point d'implantation</primary>----> <!---- <primary>points d'implantation</primary><secondary>ouvrir</secondary>----> <!---- 
<primary>position</primary><secondary>ouvrir le point d'implantation</secondary>
----> </h2>
<p>Pour retourner &agrave; une section dont vous avez pr&eacute;c&eacute;demment
consult&eacute; le point d'implantation &agrave; l'aide d'Afficher le point
d'implantation, choisissez Ouvrir le point d'implantation sur le menu Aller.
Le Gestionnaire des informations affiche la bo&icirc;te de dialogue suivante
pour vous permettre de sp&eacute;cifier le point d'implantation de la section.
</p>
<object>
<h2 id="INFOUG.Navigate.mkr.5a">Ouvrir le point d'implantation, bo&icirc;te
de dialogue</h2>
<img id="INFOUG.Navigate.igrph.1" src="./graphics/openloca.png">
</object>
<p>Sp&eacute;cifiez le point d'implantation de la section vers laquelle
vous d&eacute;placer.</p>
<p>Cliquez sur Appliquer pour aller &agrave; cette section et laisser la
bo&icirc;te de dialogue ouverte; cliquez sur OK pour aller &agrave; la section
et refermer la bo&icirc;te de dialogue.</p>
</div>
</div>
<div class="1" id="INFOUG.Navigate.div.6">
<h1 id="INFOUG.Navigate.mkr.6">Suivre les liens<!---- <primary>naviguer</primary><secondary>suivre les liens</secondary>----> <!---- <primary>liens</primary><secondary>suivre</secondary>----> </h1>
<p>Dans le Gestionnaire des informations, les liens hypertexte sont repr&eacute;sent&eacute;s
par du texte gras, soulign&eacute; et color&eacute;. Les liens vous permettent
de proc&eacute;der &agrave; des &ldquo;sauts&rdquo; rapides vers</p>
<ul>
<li><p>D'autres parties de la section en cours</p>
</li>
<li><p>D'autres sections du m&ecirc;me livre</p>
</li>
<li><p>D'autres livres de la biblioth&egrave;que d'informations</p>
</li>
</ul>
<p>Pour suivre un lien dans la fen&ecirc;tre de lecture, positionnez le
pointeur sur le texte du lien et cliquez. Pour suivre un lien dans une fen&ecirc;tre
de liste (telle que celle de l'Historique des sections), positionnez le pointeur
sur le lien et cliquez deux fois.</p>
<p>Lorsque vous suivez un lien &agrave; partir d'une fen&ecirc;tre de lecture
non ancr&eacute;e, le Gestionnaire des informations remplace la section en
cours par la nouvelle. Si la fen&ecirc;tre de lecture est ancr&eacute;e, le
Gestionnaire des informations ouvre une nouvelle fen&ecirc;tre de lecture
pour afficher la nouvelle section.</p>
<div class="2" id="INFOUG.Navigate.div.7">
<h2 id="INFOUG.Navigate.mkr.7">Pr&eacute;visualiser les destinations des
liens<!---- <primary>liens</primary><secondary>pr&eacute;visualiser les
destinations</secondary>----> <!---- <primary>naviguer</primary>
<secondary>pr&eacute;visualiser les destinations des liens</secondary>----> </h2>
<p>A partir de la fen&ecirc;tre de lecture, vous pouvez pr&eacute;visualiser
la destination d'un lien avant de d&eacute;cider de le suivre. Pour afficher
le titre de la section cible:</p>
<ol>
<li><p>Positionnez le pointeur sur le lien.</p>
</li>
<li><p>Appuyez sur le bouton gauche de la souris et maintenez-le
enfonc&eacute;. Le Gestionnaire des informations affiche la destination du
lien dans la zone de message du bas de la fen&ecirc;tre.</p>
</li>
<li><p>Pour suivre le lien, rel&acirc;chez le bouton de la souris.
Si vous d&eacute;cidez de ne pas suivre le lien, &eacute;loignez le pointeur
du lien avant de rel&acirc;cher le bouton de la souris.</p>
</li>
</ol>
</div>
</div>
<div class="1" id="INFOUG.Navigate.div.8">
<h1 id="INFOUG.Navigate.mkr.8">Retracer vos pas<!---- <primary>naviguer</primary><secondary>retracer vos pas</secondary>----> </h1>
<p>Dans certains cas, vous souhaiterez probablement repasser &agrave; une
section consult&eacute;e pr&eacute;alablement au cours de votre session d'exploration.
Pour revoir des sections ant&eacute;rieures, choisissez une des m&eacute;thodes
suivantes:</p>
<ul>
<li><p>La liste Historique des sections. Voir <xref role="JumpText"
href="#INFOUG.Navigate.div.9">.</p>
</li>
<li><p>Fl&egrave;ches de l'Historique. Voir <xref role="JumpText"
href="#INFOUG.Navigate.div.10">.</p>
</li>
</ul>
<div class="2" id="INFOUG.Navigate.div.9">
<h2 id="INFOUG.Navigate.mkr.9">Utiliser la liste Historique des sections<!---- 
<primary>naviguer</primary><secondary>&agrave; l'aide de la liste Historique
des sections</secondary>----> <!---- <primary>retracer vos pas</primary>
<secondary>&agrave; l'aide de la liste Historique des sections</secondary>
----> <!---- <primary>Historique des sections, liste</primary>----> </h2>
<p>Le Gestionnaire des informations affiche l'enregistrement chronologique
de tous vos d&eacute;placements dans les sections visit&eacute;es au cours
de la session d'exploration actuelle. Pour v&eacute;rifier rapidement les
sections d&eacute;j&agrave; lues, ouvrez la liste Historique des sections,
repr&eacute;sent&eacute;e par la figure suivante.</p>
<object>
<h2 id="INFOUG.Navigate.mkr.9a">Liste Historique des sections</h2>
<img id="INFOUG.Navigate.igrph.2" src="./graphics/histlist.png">
</object>
<p>La liste Historique des sections inclut chaque section visit&eacute;e,
de la plus r&eacute;cente &agrave; la plus ancienne. Si vous avez consult&eacute;
une section plusieurs fois par session, le Gestionnaire des informations ne
la liste qu'une fois.</p>
<p>Pour utiliser la liste Historique des sections:</p>
<ol>
<li><p>Choisissez Historique sur le menu Aller de la fen&ecirc;tre
de lecture. Le Gestionnaire des informations affiche la liste Historique des
sections.</p>
</li>
<li><p>Pour passer &agrave; une section de la liste, cliquez deux
fois sur son titre ou affichez ce titre en surbrillance, puis cliquez sur
Afficher. Si la fen&ecirc;tre de lecture n'est pas ancr&eacute;e, le Gestionnaire
des informations remplace la section en cours par la nouvelle. Si la fen&amp;ecirc;tre
de lecture est ancr&eacute;e, le Gestionnaire des informations ouvre une autre
fen&ecirc;tre de lecture pour afficher la nouvelle section.</p>
</li>
</ol>
<p>Pour refermer la liste Historique des sections sans passer &agrave;
une section pr&eacute;alablement visualis&eacute;e, cliquez sur Fermer.</p>
</div>
<div class="2" id="INFOUG.Navigate.div.10">
<h2 id="INFOUG.Navigate.mkr.10">Utiliser les fl&egrave;ches de l'Historique<!---- 
<primary>fl&egrave;ches</primary><secondary>historique</secondary>----> <!---- 
<primary>historique, fl&egrave;ches</primary>----> <!---- <primary>naviguer</primary><secondary>avec les fl&egrave;ches de l'Historique</secondary>
----> <!---- <primary>retracer vos pas</primary><secondary>avec
les fl&egrave;ches de l'Historique</secondary>----> </h2>
<p>Vous souhaiterez probablement vous d&eacute;placer vers l'arri&egrave;re
ou vers l'avant parmi la s&eacute;rie de sections pr&eacute;alablement consult&eacute;es.
Utilisez les fl&egrave;ches de l'Historique de la fen&ecirc;tre de lecture
pour vous d&eacute;placer parmi les sections d&eacute;j&agrave; lues, dans
l'ordre de lecture initial. Les fl&egrave;ches de l'Historique apparaissent
au d&eacute;but de la barre d'outils de la fen&ecirc;tre de lecture, &agrave;
gauche des fl&egrave;ches de parcours normales.</p>
<img id="INFOUG.Navigate.igrph.3" src="./graphics/hsarrows.png">
<note>
<p>Vous pouvez ex&eacute;cuter les m&ecirc;mes fonctions en choisissant
les options <comment>nouveau terme</comment>En arri&egrave;re et <comment>
nouveau terme</comment>En avant du menu <comment>nouveau terme</comment>Aller.
</p>
</note>
<p>Si vous avez consult&eacute; plusieurs fois la m&ecirc;me section au
cours de votre session d'exploration, les fl&egrave;ches de l'Historique en
feront de m&ecirc;me.</p>
<p>La fl&egrave;che vers la gauche de l'Historique vous d&eacute;place
en arri&egrave;re dans la liste des sections (vers le d&eacute;but); la fl&egrave;che
vers la droite vous d&eacute;place vers l'avant (vers la fin de la liste).
</p>
<p>Si vous vous trouvez au d&eacute;but de la liste des sections, les fl&egrave;ches
vers la gauche ou vers la droite de l'Historique ne sont plus disponibles,
indiquant que vous ne pouvez aller plus dans cette direction.</p>
</div>
</div>
<div class="1" id="INFOUG.Navigate.div.11">
<h1 id="INFOUG.Navigate.mkr.11">Visualiser les sections pr&eacute;c&eacute;dentes<!---- 
<primary>naviguer</primary><secondary>avec le bouton de titre de section</secondary>
----> <!---- <primary>retracer vos pas</primary><secondary>avec
le bouton de titre de section</secondary>----> <!---- <primary>section</primary><secondary>visualiser la pr&eacute;c&eacute;dente</secondary>
----> <!---- <primary>sections pr&eacute;c&eacute;dentes</primary>
<secondary>visualiser</secondary>----> <!---- <primary>titre de
section, bouton</primary>----> </h1>
<p>Il se peut que vous souhaitiez obtenir des informations d'ordre plus
g&eacute;n&eacute;ral que celles de la section en cours, ou une meilleure
perspective du niveau des informations &agrave; consulter. En d'autres termes,
imaginons que vous souhaitez visualiser la liste des sections pr&eacute;c&eacute;dant
la section en cours dans la structure du livre.</p>
<p>Pour afficher la liste des sections pr&eacute;c&eacute;dentes, cliquez
sur le bouton de titre de section, juste en dessous de la zone d'affichage.
</p>
<img id="INFOUG.Navigate.igrph.4" src="./graphics/sectitle.png">
<p>Le Gestionnaire des informations affiche la liste des titres de section.
</p>
<p>Vous pouvez remonter dans cette liste jusqu'au nom de la biblioth&egrave;que
contenant le livre de la section.</p>
<note>
<p>Les deux &eacute;l&eacute;ments sup&eacute;rieurs de la liste repr&eacute;sentent
le rayon et la biblioth&egrave;que d'informations. N'identifiant ni l'un<?Pub Caret> ni
l'autre une section sp&eacute;cifique, ils ne peuvent &ecirc;tre s&eacute;lectionn&eacute;s.
</p>
</note>
<p>Pour passer &agrave; une section quelconque de la liste, cliquez sur
son titre. Si la fen&ecirc;tre de lecture n'est pas ancr&eacute;e, le Gestionnaire
des informations remplace la section en cours par la nouvelle. Si la fen&amp;ecirc;tre
de lecture est ancr&eacute;e, le Gestionnaire des informations ouvre une autre
fen&ecirc;tre de lecture pour afficher la nouvelle section.</p>
<p>Pour refermer la liste des sections sans passer &agrave; une autre section,
cliquez une nouvelle fois sur le bouton de titre de section.</p>
</div>
<div class="1" id="INFOUG.Navigate.div.12">
<h1 id="INFOUG.Navigate.mkr.12">Naviguer &agrave; l'aide de la carte graphique<!---- 
<primary>carte</primary><secondary>naviguer avec</secondary>----> <!---- 
<primary>graphique, carte</primary>----> <!---- <primary>naviguer</primary><secondary>&agrave; l'aide de la carte graphique</secondary>----> </h1>
<p>Pour vous orienter dans la structure d'un livre, vous pouvez afficher
une carte graphique de ses sections. La carte constitue une sorte d' <em>arborescence</em> graphique qui affiche les titres des sections du livre.
La carte facilite la compr&eacute;hension de la structure d'ensemble du livre.
</p>
<object>
<h1 id="INFOUG.Navigate.mkr.12a">Carte graphique</h1>
<img id="INFOUG.Navigate.igrph.5" src="./graphics/graphmap.png">
</object>
<div class="2" id="INFOUG.Navigate.div.13">
<h2 id="INFOUG.Navigate.mkr.13">Ouvrir la carte<!---- <primary>carte
graphique</primary><secondary>ouvrir</secondary>----> </h2>
<p>Pour afficher la carte, cliquez sur le bouton Carte graphique de la
barre d'outils de la fen&ecirc;tre de lecture ou choisissez Carte graphique
&agrave; partir du menu Fen&ecirc;tres.</p>
<img id="INFOUG.Navigate.igrph.6" src="./graphics/gmap.png">
<p>Le Gestionnaire des informations ouvre la carte graphique, affichant
le titre de la section en cours et les titres des autres sections du livre.
</p>
</div>
<div class="2" id="INFOUG.Navigate.div.14">
<h2 id="INFOUG.Navigate.mkr.14">Faire un panoramique au travers de la carte<!---- 
<primary>carte graphique</primary><secondary>faire un panoramique</secondary>
----> </h2>
<p>Pour afficher les titres de section actuellement invisibles, proc&eacute;dez
&agrave; un panoramique au travers de la carte. Cette fonctionnalit&eacute;
est tr&egrave;s utile: les cartes sont g&eacute;n&eacute;ralement trop grandes
pour &ecirc;tre compl&egrave;tement affich&eacute;es.</p>
<p>La carte graphique contient une <u>case de panoramique</u>
dans son coin sup&eacute;rieur gauche, dans laquelle s&eacute;lectionner la
partie de la carte &agrave; afficher.</p>
<p>Pour r&eacute;aliser un panoramique au travers d'une carte:</p>
<ol>
<li><p>Positionnez le pointeur sur la zone de panoramique de la carte
des sections locales.</p>
</li>
<li><p>Appuyez sur le bouton gauche de la souris et maintenez-le
enfonc&eacute;.</p>
</li>
<li><p>Faites glisser la souris de mani&egrave;re de mani&egrave;re
&agrave; afficher la partie de la carte &agrave; consulter. Par exemple, d&eacute;placez
la zone de panoramique vers la droite pour afficher les titres dissimul&eacute;s
par le bord droit de la carte.</p>
</li>
</ol>
<note>
<p>Si vous pr&eacute;f&eacute;rez, vous pouvez ajuster la taille de toute
la carte graphique en redimensionnant la fen&ecirc;tre.</p>
</note>
</div>
<div class="2" id="INFOUG.Navigate.div.15">
<h2 id="INFOUG.Navigate.mkr.15">Aller &agrave; une section de la carte<!---- 
<primary>carte graphique</primary><secondary>aller &agrave; une section</secondary>
----> </h2>
<p>Pour afficher une section repr&eacute;sent&eacute;e sur la carte graphique,
cliquez sur le titre de cette section. Si la fen&ecirc;tre de lecture n'est
pas ancr&eacute;e, le Gestionnaire des informations remplace la section en
cours par la nouvelle. Si la fen&amp;ecirc;tre de lecture est ancr&eacute;e,
le Gestionnaire des informations ouvre une autre fen&ecirc;tre de lecture
pour afficher la nouvelle section.</p>
</div>
<div class="2" id="INFOUG.Navigate.div.16">
<h2 id="INFOUG.Navigate.mkr.16">Mettre la carte graphique &agrave; jour<!---- 
<primary>carte</primary><secondary>mettre &agrave; jour</secondary>----> </h2>
<p>Pour actualiser la carte graphique de mani&egrave;re &agrave; afficher
votre emplacement actuel dans un livre, cliquez sur le bouton Mise &agrave;
jour automatique afin de refl&eacute;ter votre position chaque fois que vous
vous d&eacute;placez au sein d'un livre, choisissez Pr&eacute;f&eacute;rences
de carte sur le menu Options, puis activez Mise &agrave; jour automatique.
</p>
</div>
</div>
</chapter>
<?Pub *0000023538>
</body></html>
