<html><body>
<!-- $XConsortium: ch08.sgm /main/3 1996/12/20 20:00:08 rws $ -->
<!-- (c) Copyright 1996 Digital Equipment Corporation. -->
<!-- (c) Copyright 1996 Hewlett-Packard Company. -->
<!-- (c) Copyright 1996 International Business Machines Corp. -->
<!-- (c) Copyright 1996 Sun Microsystems, Inc. -->
<!-- (c) Copyright 1996 Novell, Inc. -->
<!-- (c) Copyright 1996 FUJITSU LIMITED. -->
<!-- (c) Copyright 1996 Hitachi. -->
<chapter id="INFOUG.Custom.div.1">
<title id="INFOUG.Custom.mkr.1">Personnaliser le Gestionnaire des informations<!---- 
<primary>pr&eacute;f&eacute;rences</primary><secondary>configurer</secondary>
----> <!---- <primary>Gestionnaire des informations</primary><secondary>personnaliser</secondary>----> </title>
<p>Vous pouvez modifier certains aspects de plusieurs fonctionnalit&eacute;s
du Gestionnaire des informations, dont vos pr&eacute;f&eacute;rences pour
les fonctions suivantes:</p>
<variablelist>
<varlistentry><term>Explorateur</term>
<li>
<p>Vous pouvez sp&eacute;cifier la taille par d&eacute;faut de la police,
la g&eacute;om&eacute;trie et l'&eacute;tat d'ancrage de la fen&ecirc;tre
<a  role="JumpText" href="#INFOUG.Custom.div.2" >de lecture. Voir </a>.</p>
</li>
</varlistentry>
<varlistentry><term>Carte</term>
<li>
<p>Vous pouvez d&eacute;terminer la g&eacute;om&eacute;trie par d&eacute;faut
de la carte et si la carte g&eacute;ographique est actualis&eacute;e automatiquement
&agrave; mesure de vos d&eacute;placements dans la biblioth&egrave;que d'informations.
<a  role="JumpText" href="#INFOUG.Custom.div.6" >Voir </a>.</p>
</li>
</varlistentry>
<varlistentry><term>Historique</term>
<li>
<p>D&eacute;terminez le nombre maximal de titres de section inclus dans
les listes Historique des sections et Historique des recherches. Voir <xref
role="JumpText" href="#INFOUG.Custom.div.9">.</p>
</li>
</varlistentry>
<varlistentry><term>Recherche</term>
<li>
<p>Indiquez le maximum de titres de section &agrave; inclure dans les listes
R&eacute;sultats de la recherche et si la premi&egrave;re concordance (ou <em>r&eacute;ponse pertinente</em>) est affich&eacute;e automatiquement
<a  role="JumpText" href="#INFOUG.Custom.div.12" >dans une fen&ecirc;tre de lecture. Voir </a>.
</p>
</li>
</varlistentry>
</variablelist>
<p>Pour changer un de ces attributs, choisissez Pr&eacute;f&eacute;rences
sur le menu Options d'une fen&ecirc;tre de lecture quelconque. Le Gestionnaire
des informations ouvre la fen&ecirc;tre Pr&eacute;f&eacute;rences comme l'indique
la figure suivante.<!---- <primary>Pr&eacute;f&eacute;rences, fen&ecirc;tre</primary><secondary>exemple</secondary>----> </p>
<object>
<title id="INFOUG.Custom.mkr.1a">La fen&ecirc;tre Pr&eacute;f&eacute;rences</title>
<img id="INFOUG.Custom.igrph.1" src="./graphics/mappref.png">
</object>
<note>
<p>Pour maintenir les pr&eacute;f&eacute;rences en vigueur lors de l'ouverture
initiale de la fen&ecirc;tre Pr&eacute;f&eacute;rences, cliquez sur <comment>
Je d&eacute;teste &ldquo;Restaurer&rdquo; mais enfin on a pas le choix</comment>Restaurer
avant de refermer la fen&ecirc;tre Pr&eacute;f&eacute;rences.</p>
</note>
<div class="1" id="INFOUG.Custom.div.2">
<h1 id="INFOUG.Custom.mkr.2">Configurer des pr&eacute;f&eacute;rences d'exploration<!---- 
<primary>parcourir</primary><secondary>d&eacute;finir des pr&eacute;f&eacute;rences
d'exploration</secondary>----> <!---- <primary>Explorateur</primary>
<secondary>d&eacute;finir des pr&eacute;f&eacute;rences</secondary>----> <!---- 
<primary>pr&eacute;f&eacute;rences</primary><secondary>parcourir</secondary>
----> </h1>
<p>Vous pouvez modifier les comportements par d&eacute;faut suivants de
l'explorateur:</p>
<ul>
<li><p>G&eacute;om&eacute;trie de l'explorateur. Voir <xref role="JumpText"
href="#INFOUG.Custom.div.3">.</p>
</li>
<a  role="JumpText" href="#INFOUG.Custom.div.5" ><li><p>Echelle de la police. Voir </a>.
</p>
</li>
<li><p>Etat d'ancrage de la fen&ecirc;tre. Voir <xref role="JumpText"
href="#INFOUG.Custom.div.6">.</p>
</li>
</ul>
<p>Pour ouvrir la fen&ecirc;tre Pr&eacute;f&eacute;rences d'exploration,
s&eacute;lectionner Explorer sur la zone de liste d&eacute;roulante des pr&eacute;f&eacute;rences.
</p>
<p>La figure suivante repr&eacute;sente les Pr&amp;eacute;f&amp;eacute;rences
d'exploration.</p>
<object>
<h1 id="INFOUG.Custom.mkr.2a">Pr&eacute;f&eacute;rences d'exploration</h1>
<img id="INFOUG.Custom.igrph.2" src="./graphics/prefwin.png">
</object>
<div class="2" id="INFOUG.Custom.div.3">
<h2 id="INFOUG.Custom.mkr.3">Modifier la g&eacute;om&eacute;trie de l'explorateur<!---- 
<primary>pr&eacute;f&eacute;rences</primary><secondary>taille de la fen&ecirc;tre
de lecture</secondary>----> <!---- <primary>fen&ecirc;tre de lecture</primary><secondary>d&eacute;finir une taille par d&eacute;faut</secondary>
----> </h2>
<p>Vous pouvez augmenter ou r&eacute;duire la taille par d&eacute;faut
des fen&ecirc;tres de lecture du Gestionnaire des informations en modifiant
la valeur du champ G&eacute;om&eacute;trie de l'explorateur. La taille par
d&eacute;faut est de 500x630 pixels.</p>
<p>Pour modifier la taille par d&eacute;faut de la fen&ecirc;tre de lecture
:</p>
<ol>
<li><p>A l'aide de la fonction de dimensionnement du gestionnaire
de fen&ecirc;tres, ajustez une fen&ecirc;tre &agrave; la taille que vous souhaitez
utiliser par d&eacute;faut.</p>
</li>
<li><p>Cliquez sur la case &agrave; droite du champ G&eacute;om&eacute;trie
de l'explorateur. Le Gestionnaire des informations affiche un message sur
la mani&egrave;re de d&eacute;finir la taille par d&eacute;faut.</p>
</li>
<li><p>Cliquez &agrave; l'int&eacute;rieur de la taille &agrave;
utiliser par d&eacute;faut pour la fen&ecirc;tre de lecture. Le Gestionnaire
des informations ins&egrave;re les coordonn&eacute;es de la fen&ecirc;tre
dans le champ G&eacute;om&eacute;trie de l'explorateur.</p>
</li>
<li><p>Cliquez sur OK pour appliquer la modification et refermer
la fen&ecirc;tre Pr&eacute;f&eacute;rences. Les nouvelles fen&ecirc;tres de
lecture adopteront la taille sp&eacute;cifi&eacute;e.</p>
</li>
</ol>
<note>
<p>Si vous modifiez la taille par d&eacute;faut de la fen&ecirc;tre de
lecture, les fen&ecirc;tres de lecture existantes ne sont pas redimensionn&eacute;es.
</p>
</note>
</div>
<div class="2" id="INFOUG.Custom.div.4">
<h2 id="INFOUG.Custom.mkr.4">Modifier l'&eacute;chelle de la police<!---- 
<primary>pr&eacute;f&eacute;rences</primary><secondary>fen&ecirc;tre de lecture,
taille de la police</secondary>----> <!---- <primary>fen&ecirc;tre
de lecture</primary><secondary>sp&eacute;cifier la taille par d&eacute;faut
de la police</secondary>----> </h2>
<p>Vous pouvez augmenter ou r&eacute;duire la taille de la police du texte
affich&eacute; dans la fen&ecirc;tre de lecture. Pour sp&eacute;cifier une
taille de police diff&eacute;rente, cliquez sur la Fl&egrave;che vers le haut
pour augmenter l'&eacute;chelle de la police, ou sur la Fl&egrave;che vers
le bas pour la r&eacute;duire.</p>
<p>Cliquez sur OK pour valider la modification et refermez la fen&ecirc;tre
Pr&eacute;f&eacute;rences. Le Gestionnaire des informations modifie le texte
de toutes les sections actuellement affich&eacute;es de mani&egrave;re &agrave;
refl&eacute;ter la nouvelle &eacute;chelle de police. Toute nouvelle fen&ecirc;tre
de lecture ouverte affichera adoptera &eacute;galement cette nouvelle taille
de police.</p>
<note>
<p>La modification de l'&eacute;chelle de la police peut affecter le renvoi
automatique &agrave; la ligne de la section. Pour visualiser les effets de
la modification d'&eacute;chelle de police, cliquez sur Appliquer sans refermer
la fen&ecirc;tre Pr&eacute;f&eacute;rences.</p>
</note>
</div>
<div class="2" id="INFOUG.Custom.div.5">
<h2 id="INFOUG.Custom.mkr.5">Modifier l'&eacute;tat d'ancrage de la fen&ecirc;tre<!---- 
<primary>fen&ecirc;tre de lecture</primary><secondary>&eacute;tat d'ancrage
par d&eacute;faut</secondary>----> <!---- <primary>ancrage</primary>
<secondary>&eacute;tat par d&eacute;faut</secondary>----> <!---- 
<primary>pr&eacute;f&eacute;rences</primary><secondary>&eacute;tat d'ancrage
de la fen&ecirc;tre</secondary>----> </h2>
<p>Vous pouvez d&eacute;terminer si les fen&ecirc;tres de lecture sont
ancr&eacute;es automatiquement ou pas. Par d&eacute;faut, le Gestionnaire
des informations n'ancre pas automatiquement les fen&ecirc;tres de lecture.
Cependant, si une fen&ecirc;tre de lecture n'est pas ancr&eacute;e, son contenu
est remplac&eacute; chaque fois que vous passez &agrave; une autre section.
</p>
<p>Si vous ancrez fr&eacute;quemment des fen&ecirc;tres de lecture de mani&egrave;re
&agrave; ouvrir simultan&eacute;ment plusieurs sections dans des fen&ecirc;tres
diff&eacute;rentes, configurez des pr&eacute;f&eacute;rences indiquant l'ancrage
automatiquement des fen&ecirc;tres de lecture lors de leur ouverture. Pour
ce faire, cliquez sur la case &agrave; cocher Ancrer la fen&ecirc;tre, puis
sur Appliquer.</p>
</div>
</div>
<div class="1" id="INFOUG.Custom.div.6">
<h1 id="INFOUG.Custom.mkr.6">Configurer des pr&eacute;f&eacute;rences de <comment>
Dans la liste de termes fournie par Karin, il y a &ldquo;Carte Graphique&rdquo;.
Il n'est pas n&eacute;cessaire de mettre une majuscule &agrave; Graphique.
</comment>carte graphique<!---- <primary>pr&eacute;f&eacute;rences</primary>
<secondary>carte graphique</secondary>----> <!---- <primary>carte
graphique</primary><secondary>d&eacute;finir des pr&eacute;f&eacute;rences</secondary>----> </h1>
<p>Vous pouvez modifier les attributs par d&eacute;faut suivants de la
carte graphique:</p>
<ul>
<li><p>G&eacute;om&eacute;trie de la carte. Voir <xref role="JumpText"
href="#INFOUG.Custom.div.7">.</p>
</li>
<li><p>Mise &agrave; jour automatique. Voir <xref role="JumpText"
href="#INFOUG.Custom.div.8">.</p>
</li>
</ul>
<p>Pour afficher la fen&ecirc;tre Pr&eacute;f&eacute;rences de carte, s&eacute;lectionnez
Carte sur la zone de liste d&eacute;roulante Pr&eacute;f&eacute;rences de.
</p>
<p>La figure suivante repr&eacute;sente la fen&ecirc;tre Pr&eacute;f&eacute;rences
de carte.</p>
<object>
<h1 id="INFOUG.Custom.mkr.6a">Pr&eacute;f&eacute;rences de carte</h1>
<img id="INFOUG.Custom.igrph.3" src="./graphics/mappref.png">
</object>
<div class="2" id="INFOUG.Custom.div.7">
<h2 id="INFOUG.Custom.mkr.7">Modifier la g&eacute;om&eacute;trie de la
carte<!---- <primary>pr&eacute;f&eacute;rences</primary><secondary>taille
de la carte</secondary>----> <!---- <primary>carte graphique</primary>
<secondary>d&eacute;finir la taille par d&eacute;faut</secondary>----> </h2>
<p>Vous pouvez augmenter ou r&eacute;duire la taille de la carte graphique
en modifiant la valeur du champ G&eacute;om&eacute;trie de la carte. La taille
par d&eacute;faut est de 520x350 pixels.</p>
<p>Pour modifier cette taille:</p>
<ol>
<li><p>Cliquez sur la case &agrave; droite du champ G&eacute;om&eacute;trie
de la carte. L'explorateur affiche un message expliquant comment modifier
la taille par d&eacute;faut.</p>
</li>
<li><p>Cliquez sur la fen&ecirc;tre de la taille &agrave; adopter
par d&eacute;faut pour la carte graphique. Le Gestionnaire des informations
ins&egrave;re les coordonn&eacute;es appropri&eacute;es dans le champ G&eacute;om&eacute;trie
de la carte.</p>
</li>
<li><p>Cliquez sur OK pour valider les modifications et refermer
la fen&ecirc;tre Pr&eacute;f&eacute;rences.</p>
<p>A la prochaine initialisation du Gestionnaire des informations, la taille
par d&eacute;faut de la carte graphique refl&eacute;tera la modification apport&eacute;e.
</p>
</li>
</ol>
</div>
<div class="2" id="INFOUG.Custom.div.8">
<h2 id="INFOUG.Custom.mkr.8">Configurer la mise &agrave; jour automatique<!---- 
<primary>carte graphique</primary><secondary>configurer la mise &agrave; jour
automatique par d&eacute;faut</secondary>----> <!---- <primary>pr&eacute;f&eacute;rences</primary><secondary>&eacute;tat de mise &agrave;
jour automatique de la carte</secondary>----> </h2>
<p>Vous avez la possibilit&eacute; de sp&eacute;cifier si le Gestionnaire
des informations met automatiquement &agrave; jour la carte graphique de mani&egrave;re
&agrave; refl&eacute;ter la section en cours de lecture dans la fen&ecirc;tre
de lecture active.</p>
<p>Pour indiquer au Gestionnaire des informations de mettre automatiquement
la carte graphique &agrave; jour:</p>
<ol>
<li><p>Faites basculer le bouton Mise &agrave; jour automatique sur
le r&eacute;glage de votre choix.</p>
</li>
<li><p>Cliquez sur Appliquer.</p>
</li>
</ol>
</div>
</div>
<div class="1" id="INFOUG.Custom.div.9">
<h1 id="INFOUG.Custom.mkr.9">Configurer les historiques<!---- <primary>pr&eacute;f&eacute;rences</primary><secondary>historiques</secondary>----> <!---- 
<primary>historiques</primary><secondary>d&eacute;finir des valeurs par d&eacute;faut</secondary>----> </h1>
<p>Il se peut que vous n'utilisiez jamais la plupart des entr&eacute;es
incluses dans les listes Historique des sections et Historique des recherches
et que vous pr&eacute;f&eacute;riez par cons&eacute;quent limiter la longueur
de ces listes. Vous pouvez modifier le nombre maximal de sections incluses
dans:</p>
<ul>
<li><p>Liste Historique des sections. Voir <xref role="JumpText"
href="#INFOUG.Custom.div.10">.</p>
</li>
<li><p>Liste Historique des recherches. Voir <xref role="JumpText"
href="#INFOUG.Custom.div.11">.</p>
</li>
</ul>
<p>Pour afficher la fen&ecirc;tre Pr&eacute;f&eacute;rences d'historique,
s&eacute;lectionnez Historique sur la zone de liste d&eacute;roulante Pr&eacute;f&eacute;rences
de.</p>
<p>La figure suivante repr&eacute;sente la fen&ecirc;tre Pr&eacute;f&eacute;rences
d'historique.</p>
<object>
<h1 id="INFOUG.Custom.mkr.9a">Pr&eacute;f&eacute;rences d'historique</h1>
<img id="INFOUG.Custom.igrph.4" src="./graphics/histpref.png">
</object>
<div class="2" id="INFOUG.Custom.div.10">
<h2 id="INFOUG.Custom.mkr.10">Modifier la liste Historique des sections<!---- 
<primary>pr&eacute;f&eacute;rences</primary><secondary>taille de la liste
Hostorique des sections</secondary>----> <!---- <primary>Historique
des sections, liste</primary><secondary>d&eacute;finir la taille par d&eacute;faut</secondary>----> </h2>
<p>Vous pouvez modifier le nombre maximal de titres de section maintenus
par le Gestionnaire des informations dans la liste Historique des sections.
La valeur par d&eacute;faut est 100 sections.</p>
<p>Pour modifier le nombre maximal de sections dans la liste Historique
des sections, cliquez sur la fl&egrave;che vers le haut pour augmenter le
nombre ou la fl&egrave;che vers le bas pour le r&eacute;duire.</p>
<p>Cliquez sur OK pour appliquer la modification et refermer la fen&ecirc;tre
Pr&eacute;f&eacute;rences. Le Gestionnaire des informations limite la liste
Historique des sections au nombre des sections sp&eacute;cifi&eacute;.</p>
</div>
<div class="2" id="INFOUG.Custom.div.11">
<h2 id="INFOUG.Custom.mkr.11">Modifier la liste Historique des recherches<!---- 
<primary>pr&eacute;f&eacute;rences</primary><secondary>liste Historique des
recherches</secondary>----> <!---- <primary>Historique des recherches,
liste</primary><secondary>d&eacute;finir la taille par d&eacute;faut</secondary>
----> </h2>
<p>Vous pouvez modifier le nombre maximal de titres de section maintenus
par le Gestionnaire des informations dans la liste Historique des recherches.
La valeur par d&eacute;faut est de 50 sections.</p>
<p>Pour modifier le nombre maximal de sections dans la liste Historique
des recherches, cliquez sur la fl&egrave;che vers le haut pour augmenter le
nombre ou la fl&egrave;che vers le bas pour le r&eacute;duire.</p>
<p>Cliquez sur OK pour appliquer la modification et refermer la fen&ecirc;tre
Pr&eacute;f&eacute;rences. Le Gestionnaire des informations limite la liste
Historique des recherches au nombre de sections sp&eacute;cifi&eacute;.</p>
</div>
</div>
<div class="1" id="INFOUG.Custom.div.12">
<h1 id="INFOUG.Custom.mkr.12">Modifier les pr&eacute;f&eacute;rences de
recherche<!---- <primary>pr&eacute;f&eacute;rences</primary><secondary>recherche</secondary>----> <!---- <primary>rechercher</primary>
<secondary>d&eacute;finir des pr&eacute;f&eacute;rences</secondary>----> </h1>
<p>Vous pouvez d&eacute;finir les pr&eacute;f&eacute;rences de recherche
suivantes:</p>
<ul>
<a  role="JumpText" href="#INFOUG.Custom.div.13" ><li><p>Maximum de correspondances. Voir </a>.
</p>
</li>
<li><p>Affichage automatique de la premi&egrave;re correspondance.
<a  role="JumpText" href="#INFOUG.Custom.div.14" >Voir </a>.</p>
</li>
</ul>
<p>Pour afficher la fen&ecirc;tre Pr&eacute;f&eacute;rences de recherche,
s&eacute;lectionnez Recherche sur la zone de liste d&eacute;roulante Pr&eacute;f&eacute;rences
de.</p>
<p>La figure suivante repr&eacute;sente la fen&ecirc;tre Pr&eacute;f&eacute;rences
de recherche.</p>
<object>
<h1 id="INFOUG.Custom.mkr.12a">Pr&eacute;f&eacute;rences de recherche</h1>
<img id="INFOUG.Custom.igrph.5" src="./graphics/serchprf.png">
</object>
<div class="2" id="INFOUG.Custom.div.13">
<h2 id="INFOUG.Custom.mkr.13">D&eacute;finir le maximum de correspondances<!---- 
<primary>rechercher</primary><secondary>d&eacute;finir le maximum de correspondances
par d&eacute;faut</secondary>----> <!---- <primary>pr&eacute;f&eacute;rences</primary><secondary>d&eacute;finir le maximum de correspondances par d&eacute;faut</secondary>----> </h2>
<p>Vous trouvez peut-&ecirc;tre que la liste de recherche renvoie<?Pub Caret> trop
de correspondances (ou <em>r&eacute;ponses</em>). Pour raccourcir
ces listes, vous pouvez modifier le nombre maximal de titres de section affich&eacute;s
dans la liste R&eacute;sultats de la recherche. La valeur par d&eacute;faut
est de 50 sections.</p>
<p>Pour modifier le maximum de sections dans la liste R&eacute;sultats
de la recherche, cliquez sur la fl&egrave;che vers le haut pour l'augmenter
ou sur la fl&egrave;che vers le bas pour r&eacute;duire ce nombre.</p>
<p>Cliquez sur OK pour valider la modification et refermer la fen&ecirc;tre
Pr&eacute;f&eacute;rences. Le Gestionnaire des informations limite la liste
R&eacute;sultats de la recherche au nombre de sections ainsi indiqu&eacute;.
</p>
</div>
<div class="2" id="INFOUG.Custom.div.14">
<h2 id="INFOUG.Custom.mkr.14">Configurer l'affichage automatique de la
premi&egrave;re correspondance<!---- <primary>pr&eacute;f&eacute;rences</primary><secondary>configurer l'affichage automatique par d&eacute;faut
de la premi&egrave;re correspondance</secondary>----> <!---- <primary>rechercher</primary><secondary>configurer l'affichage automatique par d&eacute;faut
de la premi&egrave;re correspondance</secondary>----> </h2>
<p>Pour afficher automatiquement la premi&egrave;re section contenant des
correspondances (ou <em>r&eacute;ponses pertinentes</em>) significatives,
utilisez la fen&ecirc;tre Pr&eacute;f&eacute;rences pour configurer la fonctionnalit&eacute;
Affichage automatique de la premi&egrave;re correspondance. Cliquez sur le
bouton Affichage automatique de la premi&egrave;re correspondance pour indiquer
au Gestionnaire des informations d'activer ou de d&eacute;sactiver cette fonctionnalit&eacute;.
Cliquez sur OK pour appliquer la modification et refermer la fen&ecirc;tre
Pr&eacute;f&eacute;rences.</p>
</div>
</div>
</chapter>
<?Pub *0000023793>
</body></html>
